/*
    classes
        자바스크립트는 가장 빠르게 발전하는 언어 중에 하나이다.
        전통적인 객체 지향의 문법을 채택하므로써 이미 객체 지향울 사용할 수 있는 
        사람들이 문법적인 거부감 없이 자바스크립트에 안착할 수 있도록 한다.

        구 중에 하나가 class 이다.
        다른 많은 언어들은 객체를 만드는 공장으로써 class를 지원하고 있다.
        construct의 대체재라고 할 수 있는 class에 대해서 살펴보자.
    
    호환성과 치환
        자바스크립트는 ECMA script라는 표준을 따르는데
        class는 EMCA script 6부터 도입 된 문법이다.
        이전 버전에서는 동작히지 않는다는 단점을 가지고 있다.
        하지만 오늘날 많은 웹브라우저와 Node.js와 같은 플랫폼들이 ECMA script 6이상의
        버전을 지원하고 있기 때문에 크게 문제가 되지는 않는다.

        자바스크립트는 원래 객체 지향 언어였고 prototype 기반 언어이다.
        그리고 새롭게 도입된 문법은 이미 존재하던 기능을 변형한 문법이다.
        즉 기존에 존재하는 문법으로도 똑같은 기능을 낼 수 있다.
*/